def solution(date1, date2):
    '''
    겨레와 나라 위해 목숨을 바치니
그 정성 영원히 조국을 지키네
조국의 산하여 용사를 잠재우소서
충혼은 영원히 겨레 가슴에
임들은 불멸하는 민족혼의 상징
날이 갈수록 아아 그 충성 새로워라
《현충일 노래》

현충일(顯忠日)은 '충렬을 드러내는 날'이라는 뜻으로[1] 매년 6월 6일 민족과 국가의 수호 및 발전에 기여하고 국가를 위해 희생되거나 목숨을 바친 사람들[2]을 애도하는 날이자 모든 이들의 충성을 기념하기 위한 법정공휴일이다. 후술하겠지만 국가 추념일일 뿐 절대 국경일이 아니다.[3] 6월이 호국 보훈의 달이라 불리는 이유 중 하나이기도 하며, 6월의 꽃이라 불린다.
현충일은 400년 동안 월요일, 수요일, 토요일에 58번, 목요일, 금요일은 57번, 화요일, 일요일은 56번[9] 온다. 그러나 현충일은 일요일에 걸려도 대형마트 의무휴업에는 걸리지 않는다.[10] 현충일을 음력으로 환산하면 4월 16일~5월 15일[11]이고 윤달이 낀다면 100% 윤 4월이다. 만약 역법 개정이 이루어지지 않는다면 서기 34,000년쯤에는 부처님오신날과 겹칠 수도 있다. 역법이 국제고정력으로 바뀐다면 현충일은 6월 17일로 바뀌며, 그 상태에서 6월 첫째 주 월요일로 바뀐다면 6월 2일이 된다.

서울 기준으로 현충일에는 오전 5시 11분에 해가 떠서 오후 7시 51분에 해가 저문다. 이 때문에 현충일은 한국의 공휴일 중 낮이 가장 긴 공휴일이다.[12]

과거 대체 휴일 제도 시행 전에는 현충일이 일요일인 해[13]에는 광복절도 같이 일요일이 되므로[14] 여름 석 달 동안 휴가철과 토, 일요일을 빼고는 쉬지 못하는 상황이 연출되었다. 심지어 이 경우에는 제헌절이 공휴일로 재지정되어도 토요일이라 제대로 못 쉬었다.[15]

현충일뿐 아니라 일부 공휴일을 날짜제에서 요일제로 바꾸는 방안이 있었다. 실제로 2015년 현충일을 6월 6일에서 6월 첫째 주 월요일로 옮기는 방안이 추진되다가 흐지부지되었는데 정서 등의 여러 이유로 요일제로 바꾸는 건 힘들었다.[16] 대신 대체공휴일의 전면 시행이 대안이었으나 이해관계가 복잡히 얽혀있어 시행 가능성이 불투명했다. 그러다가 문재인 정부 출범 이후 대체공휴일의 범위를 넓히기로 함에 따라 현충일의 대체공휴일 적용 여부에 관심이 모아졌다. 그러나 몇 차례 걸친 개정 끝에 대체공휴일 적용 범위를 설연휴, 3.1절, 어린이날, 부처님오신날, 광복절, 추석연휴, 개천절, 한글날, 성탄절로 국한하는 방안이 확정됨에 따라 현충일은 계속 6월 6일 당일만 쉬게 됐다. 현충일의 경우 앞서 서술했듯이 국경일이 아니기 때문에 대체공휴일 확대에서 일단 제외된 상황이다. 2023년 기준 새해 첫날과 함께 대체공휴일이 적용되지 않는 둘 뿐인 공휴일이다.[17]
현충일이 6월 6일로 지정된 이유에 대해서 정확히 알려진 바는 없다. 제정 당시 언론 보도는 물론, 국무회의 기록에서도 정확한 지정 이유를 밝혀 두지 않았다. 때문에 과거 한겨레 등 논설에서는 이를 이유로 현충일 재고의 필요성을 역설한 적 있다. 다만, 국가보훈부나 국가기록원 등에서는 현충일의 유래로 아래의 망종 유래설을 들고있다.#
망종 유래설
현충일을 6월 6일로 제정한 이유에 대한 가설 중 유명한 것이 바로 '망종 유래설'이다. 즉 현충일이 재정된 해 망종은 6월 6일인데 이날이 현충일이 되었다는 이야기다. 같은 원리는 이승만 정부의 어린이날에서도 찾을 수 있다. 해방 뒤 첫 어린이날인 1946년 5월 첫 번째 일요일이 5월 5일이었는데, 날짜가 달라지는 불편을 막기 위해 1946년 이후로는 요일에 관계없이 5월 5일을 어린이날로 정했고, 이 날짜가 오늘날까지 이르게 된다. 과거 농경 사회에서 망종을 중시했고, 고려 시대부터 망종 날에 사망한 군사를 추모했다는 것 때문에 현충일을 6월 6일로 정했다는 것이다. 그러나 이 유래설에는 직접적인 근거는 제시되어 있지 않다. 기본적으로 농경사회에서 망종이란 절기를 중시하기는 했지만, 어디까지나 가을걷이할 곡식을 파종하는 마지막 기간으로서 중시되었으며 망종 때의 세시 풍속은 첫 수확한 보리를 먹고 건강을 지키려 했다거나, 망종날 날씨를 통해 점을 쳤다는 것 정도가 잘 알려져 있으며, # 이 날 추모제를 지내는 것이 보편적인 풍습이었는지는 확인하기 어렵다.

망종 때 사망한 군인을을 추모했다고 하는 이야기는 고려 현종 5년(1014년) 6월에 반포한 교서에서 찾는데, 교서의 내용은 향후 매년 정기적으로 사망한 군인을 추모하는 것을 정례화한다는 내용이 아니라, 타지에서 사망한 병사와 무연고 사망자의 시신을 수습하는 일종의 매뉴얼을 정한 것으로 현충일과 직접적인 관계를 찾기는 어렵다. 이에 국가보훈처 등은 해당 교서를 1014년 6월 6일에 반포한 것에 유래해 현충일을 6월 6일로 정한 것이라 주장한다. 날짜의 경우, 본래 해당 교서의 기사는 음력 6월 6일자 기사이며, # 개천절의 유래와 마찬가지로 숫자를 유지한 채 역법만 음력에서 양력인 그레고리력으로 바꾼 것이 된다. 다만 이러한 환산 역시 보편적인 방법은 아닌데, 충무공탄신일과 스승의날에 빗대어 현충일을 제정한다면 그 날짜는 6월이 아닌 7월이 되었어야 했다. 즉, 해당 기사가 망종 유래설의 직접적인 근거가 된다고 하기는 부족한 점이 많다.
6.25 전쟁 관련설
현충일의 날짜 제정과 관련되어 그나마 합리적이고 유력한 가설은 6.25 전쟁의 발발 시점이 1950년 6월이었기 때문에 6월의 적당한 날을 골라서 6월 6일로 정했다는 것이다.# 미국의 메모리얼 데이의 경우도 전몰자를 한정한 추도기념일이며, 실제로 현 국립서울현충원의 전신은 6.25전쟁 당시 전몰자를 합동 안치하기 위해 조성한 국군묘지였다. 오늘날 현충일에 추도의 대상이 전몰자를 포함해 순직 공무원, 독립유공자, 기타 전사자 등으로 확대되었지만, 애초에 1956년 현충일 제정 당시 언론 보도와 정부의 공식 성명 등을 확인하면 6.25전사자를 전국민적으로 추도하기 위해 제정했다고 명시하였다. # 즉, 현충일 제정 배경과 관련해서 확인되는 공식적인 기록은 6.25 전쟁 전후 전몰 장병 추모를 위한 국가 차원의 추념일 제정을 위함이라고 명시하였다. 다만 굳이 6월 6일로 지정한 원인은 명시되지 않았고 공식적인 기록이 없어 국가보훈부에서 망종 유래설을 내세우는 등 다양한 경우의 수가 논의 되고 있다.
지상파, 종합편성채널 등에서는 이날 하루는 남북한을 소재로 한 전쟁 영화나 드라마, 또는 외국 전쟁 영화를 특선으로 방영한다. 현충일에 특선으로 방영되었던 해외 전쟁극 중 유명한 사례로 에어리어88이 있다. 2016년 현충일 저녁에 KBS 2TV에서 연평해전을 특선방영했고, KBS 1TV에서는 R2B: 리턴 투 베이스, EBS 1TV에서는 고지전, 태극기 휘날리며와 같은 군사 영화를 특선방영했다.
1990년대 초반까지만 하더라도 현충일 당일에 지상파 주요 예능을 결방하고 그 시간에 특선 영화와 다큐멘터리를 편성했다. 최근에는 정규 편성표에 있는 예능은 특별한 경우가 아닌 한 대체적으로 정상 방송하며, 오후 시간대에 특선 영화 등을 방영하는 편이다.
중학교 2학년 이상의 학생들은 학사일정상 현충일에 제대로 쉬지 못하는 경우가 많다.[18] 대학들은 아예 현충일이 지난지 1주일 뒤면 바로 기말고사를 보고, 6월 하순이면 이미 종강이므로 기말고사와 종강이 동시에 찾아오게 된다. 또, 중고등학생들의 기말고사가 약 3~4주 앞으로 다가오는 시기이기도 하며, 수행평가도 이 시기에 몰리는 경우가 많다.[19][20][21] 게다가 수능 수험생에게 매우 중요한 6월 모의평가도 현충일 근처에 위치해 있어서 이를 준비하거나 아니면 이미 모의평가를 치러서 문제 등을 분석하려는 경우가 많다. 따라서 공휴일 치고는 도서관 특히 열람실 이용객이 늘어나는 편이다. 대학 도서관은 말할 것도 없고 공휴일에 개관하는 공공도서관[22]에도 사람들이 몰려서 좌석난이 발생하는 경우가 많이 생긴다. 다만, 지방직 9급 공무원 시험은 현충일 즈음에 치러진다.
만약 이날 축구나 야구 경기가 열린다면 선수들이 경기 전에 단체로 묵념을 한다. KBO 리그에서도 현충일 당일에는 응원단장과 치어리더 등 응원단의 동원을 자제하는 편이다. 이날에는 아예 응원단이 나오지 않거나 응원단장과 북을 치는 고수 정도만 파견해서 응원을 진행하는 경우도 있다.[23] 아울러 현충일 즈음 홈경기를 치르는 팀은 MLB에서 전래된 전투복 무늬의 밀리터리 유니폼을 입고 경기를 치르곤 한다.[24] 현재 KIA 타이거즈를 뺀[25] 전 구단이 밀리터리 유니폼을 보유하고 있다.

현충일은 FIFA 월드컵 기간과 이따금 겹치기도 했다. 실제로 겹친 것은 2002 한일 월드컵이 마지막이며, 조금 더 개최 시기가 늦는 올림픽과 겹치는 일은 없다. 다만 한국에서 올림픽이 다시 개최될 경우 7~9월이 장마, 폭염, 태풍 등의 변수로 인해 제대로 경기를 치를 수 없다[26]는 점을 들어 5월이나 6월로 개최 시기를 당기자는 주장을 하기도 하는데, 5월로 당길 경우 어린이날이나 부처님오신날이, 6월로 당길 경우 현충일이 올림픽에 겹칠 수도 있으며, 올림픽을 개최할 해의 부처님오신날이 늦게 오면 부처님오신날과 현충일이 모두 올림픽 기간에 낄 수도 있다. 이렇게 되면 현충일 오전에 열리는 올림픽 경기에서는 선수들이 경기 전 묵념을 할 수도 있다. 이미 2022년 6월 6일 한국에서 열린 한국 vs 칠레 축구 친선경기에서 양측 선수들이 경기 전에 단체로 묵념을 한 선례가 있기 때문에 가능성이 아주 없는 것은 아니다.
1986 멕시코 월드컵에서 한국이 첫 승점을 획득한 경기가 한국 시간으로 현충일에 열렸다.
2002 한일 월드컵 도중 현충일이 꼈다. 보통은 월드컵 이전에 현충일이 끼지만 2002 월드컵은 장마철을 피하기 위해 일부러 앞당겨 현충일이 끼게 되었다. 현충일에는 A조 두 경기(덴마크 vs 세네갈, 우루과이 vs 프랑스)와 E조의 카메룬 vs 사우디아라비아의 경기를 했고 세 경기에서 3골이 나왔다. (덴마크 1:1 세네갈, 프랑스 0:0 우루과이, 카메룬 1:0 사우디아라비아) 골을 넣은 선수는 욘 달 토마손, 살리프 디아오[27], 사무엘 에투였다. 선수들이 경기 전에 단체로 묵념을 했는지는 불명.
2009년 현충일에는 대한민국 축구 국가대표팀이 2010 남아공 월드컵 진출을 확정지은 날이었다. 사실 대한민국 축구 국가대표팀은 이 경기 말고도 현충일에 경기를 4번 치러 4번 모두 이겼다.[28]
2022년 현충일에는 대한민국 축구 국가대표팀이 칠레와의 축구 친선경기를 치르고 양 팀 선수들이 경기 전에 묵념을 했다.
2024년 현충일에는 대한민국 축구 국가대표팀이 싱가포르와의 월드컵 지역예선으로 경기를 치른다. 원정으로 싱가포르에서 치뤄지기 때문에 묵념이 진행되지 않을 가능성도 없잖아 있다.
1944년 6월 6일 제2차 세계 대전 당시 연합군은 독일 점령하 프랑스 북부 해안 지역에 상륙하여 장기적으로 유럽 진출의 교두보를 마련했는데 이것이 그 유명한 노르망디 상륙작전이다.
전, 현직 대기업 CEO들이 언론 인터뷰를 통해 공휴일에서 빼줬으면 좋겠다고 하고 있는데, 한글날도 CEO들의 간접적이지만 지속적인 어필로 공휴일에서 사라졌으나, 한글의 중요성과 우수성이 재조명되고 한글학회의 지속적인 노력에 2013년 공휴일로 환원되었다. 지금은 워라밸 등의 사회 분위기가 많이 확산되면서 공휴일 축소를 주장했다간 자칫 여론의 뭇매를 맞을 가능성[29]이 있어 과거에 비해 이와 같은 목소리가 크게 나오지는 않고 있다. 한때 공휴일의 감축보단 대체공휴일 확대에 적극적으로 반대 의견을 내고 있었지만 압도적인 여론 등에 밀려 2021년 하반기 대체공휴일 확대에 큰 목소리를 내지 못했다.[30] 그래도 제헌절 등의 공휴일 확대를 막은 것과 새해 첫날, 현충일의 대체휴일을 미적용시킨 것은 나름의 성과일 듯.
한편 호국보훈단체와 광복회 등 독립단체들은 1년 중 유일하게 순국선열 및 전몰장병들에게 추모를 표하는 날이 이 날뿐인데 평일로 전환하게 되면 참배객 감소와 호국영령에 대한 추모의식도 경제적인 활동으로 인해 사라지게 될 것을 우려하는 것으로 알려졌다. 사실 알고 보면 현충일이 굳이 휴일로 정해진 것도 이 날만큼은 모든 일을 접고 순국선열 및 호국영령에게 은덕을 베풀고 감사하며 숭상하고 지내라는 뜻에서 공휴일로 지정했다는 일설도 있다.
2009년 6월 6일 당시 토요일에 열렸던 서울 코믹월드는 현충일에도 코스프레 행사를 열었던 것으로 알려져 일부 세간으로부터 비난을 받았다. 게다가 당시 장소 역시 윤봉길을 기리는 기념관이 위치해 있고 공원 내에 백마고지 전투 용사들의 위령비가 있는 aT센터에서 열렸으며 다행히 아무 사고 없이 끝났다. 같은 해 8월 15일에 열렸던 광복절 당일에는 코스프레 행사를 열지 않았다.
애초에 현충일은 6.25 전쟁 전후 북한의 대남 도발로 인해 순국한 전몰장병을 기리기 위한 추념일로서 제정된 기념일이었다. 이후 추념의 대상이 확대되어 항일투사를 비롯하여 순직 공무원도 추념 대상에 포함되었음에도 불구하고 주로 순국 전몰 장병을 추념하는 성격이 강하였다. 이로 인하여 김원봉과 같이 독립운동가임에도 북한 정권 수립에 참여하거나 대한민국 정부 수립을 반대하였던 사회주의 계열 인사들을 과연 현충일에 추모해야 하는지에 대해 논란이 끊이지 않고 있다.
이 날은 국립서울현충원, 국립대전현충원 앞 도로에 헬게이트가 열린다. 명절 때보다 월등히 많은 참배객들이 이날 현충원을 방문하기 때문이다. 서울 동작동은 지하철이 있어서 그나마 낫지만, 국립대전현충원은 도로가 마비상태에 빠질 정도다. 그래도 대전월드컵경기장에서 현충원으로 가는 버스는 버스전용차로 덕분에 교통체증없이 갈 수 있어서 그나마 다행.[31]
과거 '현충기념일에관한규정'이라는 국방부령이 있었으나, 2012년 1월 2일 폐지되었다. 위 규정이 제정된 후에 '각종 기념일 등에 관한 규정'(대통령령)에 현충일이 규정되었기 때문.
예전에는 유흥업소들이 유일하게 영업을 쉬는 날이 현충일이었다고 한다.[32] 스펀지 188회 방송분에 따르면 나이트클럽 중에도 문 안 여는 곳이 꽤 있는 듯하다고 한다. 성매매 특별법 발효 이전 전성기의 길음역이나 청량리 588도 1년에 하루 이 날은 경건한 마음으로 문을 열지 않았다는 전설이 있다.[33] 다만 요즘은 유흥업소들도 많이 형편이 어려운지, 아니면 현충일의 의미를 몰라서인지는 몰라도 정상 영업한다고 한다.
현재 자영업자뿐 아니라 일반 시민들에게도 현충일에 대한 의미는 많이 잊혀진 상황이다. 6.25전쟁, 월남전 참전용사들이 어느 정도 생존해 있던 1990년대~2000년대까지만 해도 현충일은 경건해야 하고 추모해야 하는 날로 인식되며 그 분위기를 체감할 수 있었다. 다만 참전용사분들 중 가장 큰 비중을 차지하는 6.25전쟁 참전용사분들 대부분이 돌아가신 현재 시점에서는 아무래도 과거보단 현충일의 의미를 알고 중요시하는 경향이 줄어든 편이다. 최근에는 현충일 오전 10시 사이렌이 울리면 1분 묵념을 해야 한다는 것조차 모르는 사람들이 태반이다.
2014년 6월 6일 네이트에서 현충일을 추모한다며 올린 추모 이미지가 제2차 세계 대전 당시 독일군 철모였다가 바뀐 일이 있었다. #
2015년 현충일에는 메르스의 대대적 유행으로 현충일 기념 행사들이 대대적으로 취소 또는 축소되었고, 2020년에는 코로나19 때문에 마찬가지로 축소되었다.
2018년에는 현충일 사상 최초로 추념식에 지창욱, 임시완, 주원, 강하늘 등 군복무 중이던 연예인 4명이 애국가를 불러 큰 주목을 받았다. 2019년에는 신동우, 성준, 김민석, 이창섭, 차학연 등 5명이 등장했다. 2021년에는 비투비의 육성재가 추념식 사회자로 나섰다. 그리고 2023년에는 강태오가 추념식에서 6·25참전유공자의 비망록을 낭독 하였다.
청주대학교 개교기념일이 이 날이다. 참고로 같은 재단에서 관할하는 청주대성고등학교의 개교기념일은 공휴일이라는 점에서 공통점이 존재하는 어린이날이다.
양구나 봉화, 평창, 철원, 제천 등 산간 지역에서는 6월 평균기온이 낮아서인지 현충일도 봄이다. 일제강점기에는 서울에서도 6월 10일에야 여름이 시작되어서인지 현충일이 봄이었으나, 1970년대 이후로는 여름으로 정착되었으며 50년 쯤 뒤에는 겨울이 짧아지고 여름이 길어지며, 여름이 더 더워져서인지 전국에서 현충일을 여름에 맞게 된다. 인천, 영주, 충주, 파주 같은 지역도 2000년대 이후 들어 현충일이 봄에서 여름으로 넘어갔다.
    '''
    
    if date1[0] < date2[0]:
        return 1
    elif date1[0] > date2[0]:
        return 0
    
    if date1[1] < date2[1]:
        return 1
    elif date1[1] > date2[1]:
        return 0
    
    if date1[2] < date2[2]:
        return 1
    else:
        return 0